{
  "_name_or_path": "camembert-base",
  "architectures": [
    "CamembertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 5,
  "classifier_dropout": null,
  "eos_token_id": 6,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-pensee",
    "2": "I-pensee",
    "3": "B-ethique_pro",
    "4": "I-ethique_pro",
    "5": "B-attitude_constructive",
    "6": "B-communication",
    "7": "I-communication",
    "8": "I-attitude_constructive",
    "9": "B-travail_equipe",
    "10": "I-travail_equipe",
    "11": "B-leadership",
    "12": "I-leadership"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-attitude_constructive": 5,
    "B-communication": 6,
    "B-ethique_pro": 3,
    "B-leadership": 11,
    "B-pensee": 1,
    "B-travail_equipe": 9,
    "I-attitude_constructive": 8,
    "I-communication": 7,
    "I-ethique_pro": 4,
    "I-leadership": 12,
    "I-pensee": 2,
    "I-travail_equipe": 10,
    "O": 0
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "camembert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.32.1",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 32005
}
